fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <posting>Deny</posting>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ВКМ_ОбновитьПодсветкуОтпусковНаСервере();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОткрытьАнализГрафика(Команда)
	
	Ключ = ВКМ_ПодготовитьДанныеДляГантаНаСервере();
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		ПоказатьПредупреждение(, "Заполните табличную часть «Отпуска сотрудников» (сотрудник и даты).");
		Возврат;
	КонецЕсли;
	
	Адрес = ПоместитьТаблицуОтпусковВоВременноеХранилище();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресВоВременномХранилище",Адрес);;
	//ПараметрыФормы.Вставить("ВКМ_КлючДанных", Ключ);
	//ПараметрыФормы.Вставить("Год", Объект.Год);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПоместитьТаблицуОтпусковВоВременноеХранилище()

	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить()); 	
    Возврат Адрес;
	
КонецФункции 

&НаСервере
Функция ВКМ_ПодготовитьДанныеДляГантаНаСервере()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Сотрудник");
	Таблица.Колонки.Добавить("ДатаНачала");
	Таблица.Колонки.Добавить("ДатаОкончания");
	Таблица.Колонки.Добавить("Подпись");
	
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаОтпуска.Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Сотрудник = Строка(СтрокаОтпуска.Сотрудник);
		НоваяСтрока.ДатаНачала = НачалоДня(СтрокаОтпуска.ДатаНачала);
		НоваяСтрока.ДатаОкончания = НачалоДня(СтрокаОтпуска.ДатаОкончания);
		НоваяСтрока.Подпись = Строка(СтрокаОтпуска.Сотрудник);
		
	КонецЦикла;
	
	Если Таблица.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат ПоместитьВоВременноеХранилище(Таблица, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	РассчитатьКоличествоДней();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	РассчитатьКоличествоДней();
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьКоличествоДней()

	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		КоличествоСекунд = НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала);
		ТекущиеДанные.КоличествоДней = Цел(КоличествоСекунд / 86400) + 1;
	КонецЕсли;

	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
		ЭлементОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);  
		ЭлементОформления.Использование = Истина;
		
		ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.КоличествоДней");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
		ЭлементОтбора.ПравоеЗначение = 28; 
		
		
		ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников");
	

КонецПроцедуры
